var songs = [
    {
        name: '月亮代表我的心',
        artist: '邓丽君',
        video: 'https://www.bilibili.com/video/BV1Zt411977p?p=1',
        neteaseAudioId: '1847408145',
        tag: '80s',
        comments: [
            {
                msg: '亲爱的小婷，我已成功到埠，原来香港真的很远，这里什么都跟天津不一样，人多，车多，楼盖的特别高',
                uploader: 'ALICE123456789啊啊啊啊'
            }, {
                msg: '人生一万多次日出，一起看一次就够了',
                uploader: '宋个耀文给轩'
            }, {
                msg: '繁星偷了人间的酒 喝得银河漫漫铺开一整片天空 我不看月亮 也不说想你 这样 月亮和你 都蒙在鼓里 我爱月亮也爱你 我看月亮的时候也在偷看你 你以为我爱月亮 只有月亮知道我爱你',
                uploader: '河北王天霖'
            }, {
                msg: '小时候每次和远在山东的姥姥通话都会给姥姥唱这首歌 这也是我学的第一首歌，是姥姥教的，后来很多年后我家去了黑龙江 ，我也不再在给姥姥唱这首歌，高二去哈尔滨集训美术，学校的艺术节上我重新听到这首温柔的歌，竟然还记得词调 于是重新唱了这首歌发给了姥姥 我的情也深我的爱也真，月亮代表我的',
                uploader: '-朝浥轻尘'
            }
        ],
        sentences: [
            '轻轻的 一个吻', '已经打动我的心', '轻轻的 一段情', '叫我思念到如今'
        ]
    }, {
        name: '美酒加咖啡',
        artist: '邓丽君',
        video: 'https://www.bilibili.com/video/BV1Dx411t7TW?p=1',
        neteaseAudioId: '1858139250',
        tag: '80s',
        comments: [
            {
                msg: '我是02的，但也爱老歌，他们都说我的心理年龄特别老。其实只是小时候爸爸妈妈爱听，跟着听，现在听来有童年的味道罢了',
                uploader: 'x云笙'
            }, {
                msg: '小时候老爸经常用VCD 放的碟子 看到电视机里面 还里的鱼珊瑚礁 和美女在圆柱的台子上穿着比基尼 五颜六色 甚是喜欢',
                uploader: '用户87354493'
            }
        ],
        sentences: [
            '明知道爱情像流水', '管他去爱谁', '我要美酒加咖啡', '一杯再一杯'
        ]
    }, {
        name: '甜蜜蜜',
        artist: '邓丽君',
        video: 'https://www.bilibili.com/video/BV1ua4y177vs?p=1',
        neteaseAudioId: '1853812727',
        tag: '80s',
        comments: [
            {
                msg: '每次听这首歌，总想起我和特莉莎在洛杉矶沙滩一起晒太阳的日子。那时候她特别喜欢骑摩托。',
                uploader: '周杰伦郑州分火轮'
            }, {
                msg: '想起来上学期坐你自行车经过主教桥，脑子里想的是电影《甜蜜蜜》李翘坐在黎小军自行车后座上穿过香港大街小巷…当时背景音乐就是这个…BUT！你自行车坏了就不修🐷这学期累死啦!差评！😒@你不傻-我傻',
                uploader: '账号已注销'
            }
        ],
        sentences: [
            '在哪里？在哪里见过你？', '在梦里，在梦里见过你'
        ]
    }, {
        name: '泉水叮咚响',
        artist: '群星',
        video: 'https://www.bilibili.com/video/BV1qD4y1Q765?from=search&seid=3390091560329668774&spm_id_from=333.337.0.0',
        neteaseAudioId: '1490707155',
        tag: '70s',
        comments: [
            {
                msg: '70年代的音乐十分匮乏，主要以各自地域为主的山歌小以及激励生产等风格为主。这首歌创作于上世纪70年代晚期，因其旋律优美，委婉动听，脍炙人口，又有浓厚的抒情寓意。　在文革期间，没有了爱情题材的文艺作品，粉碎“四人帮”后，新的文化生活开始了，这时候人民群众迫切需要有轻松的爱情歌曲，但是当时却没有。《泉水叮咚响》有如破冰般开创了爱情歌曲的先河。（部分来自百度百科“泉水叮咚响”词条）',
                uploader: 'GF-LGQ'
            }
        ],
        sentences: [
            '泉水呀泉水', '你到哪里你到哪里去', '唱着歌儿弹着琴弦流向远方', '请你告诉我的心上人', '不要想我也不要想家乡'
        ]
    }, {
        name: '年轻的朋友来相会',
        artist: '李谷一/韩东君',
        video: 'https://www.bilibili.com/video/BV18p4y197Y6?from=search&seid=5311460652083915917&spm_id_from=333.337.0.0',
        neteaseAudioId: '1334095932',
        tag: '80s',
        comments: [
            {
                msg: '80年代是通俗音乐的开始，1980年，正值中国改革开放初期，中国人民刚刚从文革的禁锢中走出来，各个领域都洋溢着“春”的气息。人民也渴望有能反映蓬勃生机的作品作为自己的精神食粮，但是此时的大街小巷里充斥的却是录音机里放出来的的港台歌曲。这一点深深地触动了作曲人谷建芬，从而点燃了她为年轻人写点歌的激情。于是她创作了《年轻的朋友来相会》。（引自百度百科）',
                uploader: 'GF-LGQ'
            }
        ],
        sentences: ['美妙的春光属于谁', '属于我 属于你', '属于我们改革开放的新一辈'],
    }, {
        name: '同一首歌',
        artist: '毛阿敏',
        video: 'https://www.bilibili.com/video/BV15A411e7at?from=search&seid=12841642195726758967&spm_id_from=333.337.0.0',
        neteaseAudioId: '276316',
        tag: '90s',
        comments: [
            {
                msg: '90年代是各种音乐的鼎盛时期，但流行音乐依旧是主流，其中混杂一些disco和地下摇滚。但触发dna的总是记忆深处的音乐，《同一首歌》这个节目不仅是许多人对的童年回忆，也是90年代歌曲的象征之一。',
                uploader: 'GF-LGQ'
            }
        ],
        sentences: ['鲜花曾告诉我你怎样走过', '大地知道你心中的每一个角落', '甜蜜的梦啊 谁都不会错过', '终于迎来今天这欢聚时刻']
    }, {
        name: '扉をあげて',
        artist: 'ANZA',
        video: 'https://www.bilibili.com/video/BV1TJ411V7a3?from=search&seid=17114217728582730674&spm_id_from=333.337.0.0',
        neteaseAudioId: '555959',
        tag: '00s',
        comments: [
            {
                msg: '00年是千禧年的开始，时光倒流20年，《魔卡少女樱》初入国内，凭借罕见的“马猴烧酒”（魔法少女）题材，出彩的剧情和精良的制作，迅速在青少年群体卷起一股潮流。这首音乐也随着这部动漫脍炙人口，流窜大街小巷。',
                uploader: 'GF-LGQ'
            }
        ],
        sentences: ['即使是不起眼的小石头', '都能不可思议地变为宝石', '只要和你一起', '见证']
    }, {
        name: 'only my railgun',
        artist: 'fripSide',
        video: 'https://www.bilibili.com/video/BV1vW411Y7Fc?from=search&seid=6751148035080886141&spm_id_from=333.337.0.0',
        neteaseAudioId: '725692',
        tag: '10s',
        comments: [
            {
                msg: '《某科学院的超电磁炮》这部动漫可以称之为入宅神番，是10年代动漫的杰出代表。每一个看b站的小伙伴几乎都明白这首歌的威力。只要放出10秒的前奏就会被刷满屏的“你指间的电光是我不灭的信仰”。b站的名字也是源于这个动漫。这个歌曲更是不少b站小伙伴的最爱。',
                uploader: 'GF-LGQ'
            }
        ],
        sentences: ['请坚信', '那一天所允诺的誓言', '即便是这双眼眸泛出的泪光', '亦将化作坚强']
    }
];
var years

function notIn(source, targetList) {
    for (var target of targetList) {
        if (source == target) return false;
    }
    return true;
}
function getWordDrops() {
    var wordDrops = [];
    for (var song of songs) {
        const wordset = new Set();
        // 将名字分割成单字添加到set中
        song.name.split("").forEach(t => wordset.add(t));
        // 将歌词连接起来分割成单字添加到set中
        song.sentences.join("").split("").filter(t => notIn(t, ["，", "。", " ", "？", "！", ".", ",", "《", "》", "（", "）", "、", "；", "“", "”", "'", '"', "~", "—", "-"])).forEach(t => wordset.add(t));
        // 将每一个单字绑定给歌曲对象添加到wordDrops中
        wordset.forEach(word => wordDrops.push({ word: word, song: song }));
    }
    return wordDrops;
}
